disoXU/STM32_projects/10-1 软件I2C读写MPU6050/Hardware/MPU6050.c
#include "stm32f4xx.h"                  // Device header
#include "MyI2C.h"
#include "MPU6050_Reg.h"
#include "Serial.h"

#define MPU6050_ADDRESS  0xD0

void MPU6050_WriteReg(uint8_t RegAddress, uint8_t Data)
{
	MyI2C_Start();
	MyI2C_SendByte(MPU6050_ADDRESS);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(RegAddress);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(Data);
	MyI2C_ReceiveAck();
	MyI2C_Stop();
}

uint8_t MPU6050_ReadReg(uint8_t RegAddress)
{
	uint8_t Data;
	
	MyI2C_Start();
	MyI2C_SendByte(MPU6050_ADDRESS);
	MyI2C_ReceiveAck();
	MyI2C_SendByte(RegAddress);
	MyI2C_ReceiveAck();
	
	MyI2C_Start();
	MyI2C_SendByte(MPU6050_ADDRESS | 0x01);
	MyI2C_ReceiveAck();
	Data = MyI2C_ReceiveByte();
	MyI2C_SendAck(1);
	MyI2C_Stop();
	return Data;
}

void MPU6050_Init(void)
{
	MyI2C_Init();
	Serial_Init();
	
	MPU6050_WriteReg(MPU6050_PWR_MGMT_1, 0x01);
	MPU6050_WriteReg(MPU6050_PWR_MGMT_2, 0x00);
	MPU6050_WriteReg(MPU6050_SMPLRT_DIV, 0x09);
	MPU6050_WriteReg(MPU6050_CONFIG, 0x06);
	MPU6050_WriteReg(MPU6050_GYRO_CONFIG, 0x18);
	MPU6050_WriteReg(MPU6050_ACCEL_CONFIG, 0x18);
	
}

void MPU6050_GetData(int16_t *AccX, int16_t *AccY, int16_t *AccZ, 
						int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ)
{
	uint8_t DataH, DataL;
	
	Serial_SendByte(0xFF);
	Serial_SendByte(0xFF);//多发几个数据头，不然simulink容易读错
	
	DataH = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_H);
	Serial_SendByte(DataH);
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_XOUT_L);
	Serial_SendByte(DataL);
	*AccX = (DataH << 8) | DataL;
	
	DataH = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_H);
	Serial_SendByte(DataH);
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_YOUT_L);
	Serial_SendByte(DataL);
	*AccY = (DataH << 8) | DataL;
	
	DataH = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_H);
	Serial_SendByte(DataH);
	DataL = MPU6050_ReadReg(MPU6050_ACCEL_ZOUT_L);
	Serial_SendByte(DataL);
	*AccZ = (DataH << 8) | DataL;
	
	DataH = MPU6050_ReadReg(MPU6050_GYRO_XOUT_H);
	Serial_SendByte(DataH);
	DataL = MPU6050_ReadReg(MPU6050_GYRO_XOUT_L);
	Serial_SendByte(DataL);
	*GyroX = (DataH << 8) | DataL;
	
	DataH = MPU6050_ReadReg(MPU6050_GYRO_YOUT_H);
	Serial_SendByte(DataH);
	DataL = MPU6050_ReadReg(MPU6050_GYRO_YOUT_L);
	Serial_SendByte(DataL);
	*GyroY = (DataH << 8) | DataL;
	
	DataH = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_H);
	Serial_SendByte(DataH);
	DataL = MPU6050_ReadReg(MPU6050_GYRO_ZOUT_L);
	Serial_SendByte(DataL);
	*GyroZ = (DataH << 8) | DataL;
	
	Serial_SendString("\r\n");
}

uint8_t MPU6050_GetID(void)
{
	return MPU6050_ReadReg(MPU6050_WHO_AM_I);
}
